[
    {
        "title" : "Computer-based weather forecast: New algorithm outperforms mainframe computer systems",
        "text" : "The Paper «Low-cost scalable discretization, prediction, and feature selection for complex systems» co-authored by Prof Igor Horenko (High-Dimensional Data Analysis Laboratory) and published in “Science Advances” 2020, has made to the top-5% of all research outputs scored by Altmetric. It was featured by a number of media-outlets (https://scienceadvances.altmetric.com/details/75128729/news), including the “HPC Wire” magazine (https://www.hpcwire.com/2020/02/19/new-algorithm-allows-pcs-to-challenge-hpc-in-weather-forecasting/)",
        "imageUrl" : "https://www.usi.ch/sites/default/files/styles/usi_medium/public/storage/images/document/8ac79e5e042ef1476e4372b079c5cca3.jpeg?itok=H6sxPKIk",
        "link" : "https://www.hpcwire.com/2020/02/19/new-algorithm-allows-pcs-to-challenge-hpc-in-weather-forecasting/"
    },
    {
        "title" : "Attendance tripled at CSCS-USI Summer School 2020",
        "text" : "The shift to online due to COVID-19 has done well to the numbers of this summer school: 100 students and working professionals logged on for the two-week series of lectures and “hands-on” labs to learn about CPU/GPU hybrid high-performance computing, with a special focus on data analytics.",
        "imageUrl" : "https://www.cscs.ch/fileadmin/_processed_/2/3/csm_Collage_SC2020_1_98e58ad23e.png",
        "link" : "https://www.cscs.ch/publications/news/2020/shift-to-online-raises-attendance-for-cscs-usi-summer-school-2020/"

    },
    {
        "title" : "Olaf Schenk elected in the Society for Industrial and Applied Mathematics (SIAM)",
        "text" : "The Society for Industrial and Applied Mathematics has elected Professor Olaf Schenk as a SIAM Fellow in the class of 2020 for his contributions to applied mathematics and extreme-scale High-performance computing (HPC). The SIAM Fellows Class of 2020 includes 28 noteworthy professionals who have made significant contributions to the fields of applied mathematics and computational science.",
        "imageUrl" : "https://www.usi.ch/sites/default/files/styles/usi_medium/public/storage/images/document/8ac79e5e042ef1476e4372b079c5cca3.jpeg?itok=H6sxPKIk",
        "link" : "https://www.usi.ch/en/feeds/13150"

    }
]
