[
    {
        "title": "The Dynamics of Innovation: latent space modelling of patent citations ",
        "abstract": "",
        "link" :"https://search.usi.ch/projects/1991/the-dynamics-of-innovation-latent-space-modelling-of-patent-citations",
        "group" : "Statistical Computing Laboratory (Prof. Wit)",
        "start" : "01.09.2020",
        "end": "31.08.2024",
        "duration" : "48 Months",
        "funding" : "SNSF",
        "status" : "Active",
        "category": "Swiss National Science Foundation / Project Funding / Division I - Humanities and Social Sciences",
        "image":"",
        
        "members": [
            {
                "name": "E. C. Wit",
                "role": "(Responsible)"   
            },
            {
                "name": "Lomi A.",
                "role": "(Co-Responsible)"   
            }
        ]
    },
    {
        "title": "High-Performance Data Analytics Framework for Power Markets Simulation",
        "abstract": "Efficient energy trading relies on high-fidelity price prediction systems with short response times. This project will advance state-of-the-art computational tools for the market pricing mechanism for meeting real-time responses in smart power grid analysis.",
        "link" :"https://search.usi.ch/projects/800/future-swiss-electrical-infrastructure",
        "group" : "Advanced Computing Laboratory (Prof. Schenk)",
        "start" : "01.08.2020",
        "end": "31.07.2023",
        "duration" : "36 Months",
        "funding" : "Innosuisse",
        "status" : "Active",
        "category": "Innosuisse / Innovation projects",
        "image":"",
        
        "members": [
            {
                "name": "Schenk O.",
                "role": "(Responsible)"
                
            }            
        ]
    },
    {
        "title": "How emergent is the brain?",
        "abstract": "The central goal of this project is to access the quality and performance of the existent and emerging machine learning (ML) and artificial intelligence (AI) approaches with respect to their ability to describe, to explain and to predict the neuronal behaviour on the basis of lab-data from mouse experiments. More common ML and AI approaches (hidden Markov models, shallow and reinforced learning, machine learning) will be compared to the very recently-developed Scalable Probabilistic Approximation approaches (Gerber et al., Sci. Adv. 2020) and to the entropy-driven approaches. Results of these comparison will aim at identifying the simplest possible (but not simpler then necessary) models that provide the most adequate lab-data descriptions. Identification of such models will enhance our understanding of emergence in the neuronal activity and provide a guidance for further experiments.",
        "link" :"",
        "group" : "High-Dimensional Data Analysis Laboratory",
        "start" : "01.01.2021",
        "end": "31.12.2023",
        "duration" : "24 Months",
        "funding" : "Carl Zeiss Foundation",
        "status" : "Active",
        "category": "Carl Zeiss Foundation ",
        "image":"",
        
        "members": [
            {
                "name": "Horenko I.",
                "role": "(Responsible)"
                
            }            
        ]
    },
    {
        "title": "Sparse inference of complex networks ",
        "abstract": "At the turn of the 21st century scientists have come to realise that a major ingredient in many modern economic, epidemiological, ecological and biological questions is to understand the network structure of the entities they study; for example, interbank lending is crucial for oiling the global economy and modern transport networks are facilitating the spread of infectious diseases. Unfortunately, even in the era of big data, computational bottle-necks have meant that only the simplest analyses have been applied to these large datasets, whereas methodological bottle-necks prevented an integrative view of complex phenomena. In short, inferring and analyzing complex networks have proven extremely difficult. Rather than simplifying the methodology prior to seeing the data, modern techniques from high-dimensional inference allow the data to select the appropriate level of complexity. The aim of this project is to integrate these techniques to the field of network analysis.",
        "link" :"https://search.usi.ch/projects/1589/sparse-inference-of-complex-networks",
        "group" : "Statistical Computing Laboratory (Prof. Wit)",
        "start" : "01.12.2019",
        "end": "30.11.2023",
        "duration" : "48 Months",
        "funding" : "SNSF",
        "status" : "Active",
        "category": "Swiss National Science Foundation / Project Funding / Division II - Mathematics, Natural and Engineering Sciences",
        "image":"",
        
        "members": [
            {
                "name": "E. C. Wit",
                "role": "(Responsible)"   
            }
        ]
    },
    {
        "title": "Balanced Graph Partition Refinement using the Graph p-Laplacian",
        "abstract": "Graph partitioning is a technique which is widely used in many fields of computer science and engineering. The goal is to partition the vertices of a graph into a certain number of disjoint sets of approximately the same size, so that a cut metric is minimized. Due to the NP-hardness of the problem and its practical importance, many different heuristics (spectral, combinatorial, evolutionist, etc.) have been developed to provide an approximate result in acceptable computational time. However, the advent of increasingly larger instances in emerging applications such as social networks or power networks renders graph partitioning and related graph algorithms such as clustering or community detection more and more important, multifaceted, and challenging. Spectral graph partitioning in the 2-norm using the eigenvectors of the graph Laplacian matrix was pioneered by Fiedler. However, this approach is considered infeasible for large-scale graphs, due to the prohibitively expensive computation of the Fiedler eigenvector, a fact that prompted the development of modern multilevel graph partitioning methods. Additionally, it has been proven that the quality of the partitions obtained by the spectral approach can be improved by considering the equivalent eigenvalue problem in the $p$-norm. The solution found for p =1, by thresholding the second eigenvector of the p-Laplacian, provides a sharp approximation to the balanced ratio Cheeger cut metric, the optimality of which is known to be still NP-hard.\nMotivated by this solid theoretical background, we recently developed a continuous relaxation of the optimal 2-way graph partitioning based on the p-norm  minimization of the graph Laplacian Rayleigh quotient. In order to avoid the expensive computation of the Fiedler eigenvector, a state-of-the-art graph partitioner is used to provide the initial partitioning that is iteratively refined. The p-norm is reduced from a 2-norm towards a 1-norm, employing for each value of p a feasibility-preserving gradient descent method that converges on the p-Laplacian eigenvector. A filter favored iterates advancing towards minimum edgecut and partition load imbalance, thus providing partitions of high quality. This approach exhibits significant improvements over state-of-the-art software packages such as METIS and KaHIP for graphs originating from various application domains of graph partitioning, including triangular Delaunay meshes and sparse matrices. Particularly high benefits were observed from the application of the p-Laplacian method on graphs emerging from electric power networks and social networks. The simplicity of the steepest-descent algorithm together with a novel explicit treatment of the feasibility constraint render the overall approach highly efficient on recent computer architectures. This potential is demonstrated by an initial  parallel implementation of our method on both shared- and distributed-memory platforms, e.g., for a large-scale application in seismic imaging.\nIn this proposal we plan to extend the aforementioned  p-Laplacian partitioning method by developing two simultaneous research directions aiming at high quality graph partitioning on modern high performance parallel architectures. The first one will utilize the structural information encoded in the third eigenvector of the graph Laplacian matrix, corresponding to the third smallest eigenvalue. Incorporating more information present in the spectra has proven to improve the traditional spectral bisection algorithm, and such an approach is expected to improve the quality of the p-Laplacian partitioning scheme as well. Moreover, we intend to study the benefits of replacing the traditional gradient descent method currently utilized, with an optimization technique tailored for nonconvex scenarios.",
        "link" :"https://search.usi.ch/projects/1036/balanced-graph-partition-refinement-using-the-graph-p-laplacian",
        "group" : "Advanced Computing Laboratory (Prof. Schenk)",
        "start" : "01.04.2019",
        "end": "31.03.2023",
        "duration" : "48 Months",
        "funding" : "SNSF",
        "status" : "Active",
        "category": "Swiss National Science Foundation / Project Funding / Division II - Mathematics, Natural and Engineering Sciences",
        "image":"",
        
        "members": [
            {
                "name": "Schenk O.",
                "role": "(Responsible)"
                
            }
        ]
    },
    {
        "title": "Preparing for next-generation approximate Bayesian inference using R-INLA,
        "abstract": "Progress in modern computing platforms and storage systems, electronic devices, and monitoring equipment has resulted in an exponential growth of the volume of data produced in several areas of science and engineering. These areas comprise of environmental sciences, biology= and medicine, satellite imaging, geospatial data, climate data, and transaction data among many others. Data processing commonly employs sophisticated statistical methods aiming to enrich the mechanisms governing the underlying physical processes and improve statistical models. Statistical analysis of such models traditionally has been carried out using Markov chain Monte Carlo methods (MCMC) used to represent complex dependency structures in data. MCMC methods provide a relatively simple approach to compute large hierarchical models requiring integration over several thousands of unknown parameters. Although MCMC methods are asymptotically exact they have slow convergence, do not scale well, and may fail for some complex models. It was soon realized that MCMC will not be able to meet modern and future big data challenges. In particular, we need to focus on extending the RINLA software ecosystem by advancing direct sparse linear solvers designed for Bayesian inference statistical computing. The sparse matrix algorithms and software implementations will be done in a codesign with data science applications in mind. By combining accelerated matrix algorithms and Bayesian inference at large scale, we plan to develop an algorithmic tool serving as part of a virtual laboratory for spatial and spatio-temporal models. This will pave the way for the next generation of data science applications based on INLA in ways not possible before. Our goal is to make our software ecosystem as productive and sustainable as possible by simultaneously focusing on algorithmic improvements to increase quality and speed, while at the same time evaluating potential benefits in various data science applications. This research project will therefore focus on solving all these fundamental challenges imposed by large-scale analytics, deep analysis and precise predictions by advancing and preparing the foundation for the next generation of RINLA.",
        "link" :"",
        "group" : "Advanced Computing Laboratory (Prof. Schenk)",
        "start" : "01.07.2020",
        "end": "31.06.2023",
        "duration" : "36 Months",
        "funding" : "King Abdullah University of Science and Technology’s Competitive Research Grant Program",
        "status" : "Active",
        "category": "King Abdullah University of Science and Technology’s Competitive Research Grant Program",
        "image":"",
        "members": [
            {
                "name": "Schenk O.",
                "role": "(Responsible)"                
            },
            {
                "name": "Haavard Rue",
                "role": "(Co-Responsible)"
                
            }
        ]
    },
    {
        "title": "EQUILIBRIA - Computing equilibria in heterogeneous agent macro models on contemporary HPC platforms",
        "abstract": "In most natural sciences computational research—and in particular high performance computing (HPC)—has become a strong, well-established third pillar, alongside with theory and experimentation. In some of these fields HPC systems can probably be considered as the most powerful and flexible research instruments available today and allow researchers to ask questions that would otherwise be impossible to address. In contrast, there is almost no work in economics that takes advantage of high-performance computing. This might seem surprising given that many economic models display highly non-linear dynamics and are very difficult to solve numerically and given that the HPC community has been reaching out actively to non-traditional fields over the last couple of years. One possible reasons for this fact is that economists do not have the skills to perform high-performance computations and do not have large enough research-groups to hire computer scientists to help them (as it is done routinely in the natural sciences).",
        "link" :"https://search.usi.ch/projects/983/computing-equilibria-in-heterogeneous-agent-macro-models-on-contemporary-hpc-platforms",
        "group" : "Advanced Computing Laboratory (Prof. Schenk)",
        "start" : "01.07.2017",
        "end": "30.06.2021",
        "duration" : "48 Months",
        "funding" : "Swissuniversities",
        "status" : "Active",
        "category": "swissuniversities / PASC - Swiss Platform for Advanced Scientific Computing",
        "image":"",
        
        "members": [
            {
                "name": "Schenk O.",
                "role": "(Responsible)"
                
            },
            {
                "name": "Kübler Felix.",
                "role": "(Third-party beneficiary)"
                
            }
        ]
        
    },
    {
        "title": "FURIESSCH - Future Swiss Electrical Infrastructure",
        "abstract": "The main research challenge of the WP2 is to build a realistic technical model of the Swiss energy system including the transmission systems, which model can be used for planning, operation, and economic evaluation of the system. This model must comprise: (i) location of renewable generation and the limited predictability of these sources; (ii) location of storage devices, both large scale, i.e. pumped hydro storage, and distributed devices; (iii)  interconnections with regional grids; (iv) interconnections on the bulk power level, i.e. high voltage lines and gas pipelines; (v) possibility to interface it with models for market and other economic simulations.\nThis work involves the modelling of individual components, which requires interaction with other WPs and possibly other SCCER, but also the development of a general system framework taking into account different energy carriers.  Furthermore, since the model will be of very high order and complexity, it should be formulated in such a way that large-scale optimization methods could be applied. In this way different optimization objectives could be used in the planning and operation of the system. The results from the optimization have to be robust.\nThe developed models should cover both slowly varying phenomena, i.e. time scale of minutes, but also faster phenomena, i.e. time scale of seconds. The models used for studying and analysing phenomena of different time scales will be different but with the same architecture. Another research challenge is the dynamics of a system with considerably lower inertia than the existing systems. Innovative geoinformation system will be used to identify locations for renewable generation and storage devices. The developed model, achieved with real data related to the system, is expected to be a powerful tool for optimizing the future Swiss energy system in terms of planning and operation.",
        "link" :"https://search.usi.ch/projects/800/future-swiss-electrical-infrastructure",
        "group" : "Advanced Computing Laboratory (Prof. Schenk)",
        "start" : "01.01.2014",
        "end": "31.03.2021",
        "duration" : "87 Months",
        "funding" : "Innosuisse",
        "status" : "Active",
        "category": "Innosuisse / SCCER - Energy funding programme",
        "image":"projectImages/furies.jpg",
        
        "members": [
            {
                "name": "Schenk O.",
                "role": "(Responsible)"
                
            },
            {
                "name": "Paolone Mario",
                "surname": "surname",
                "role": "(Third-party beneficiary)"
               
            }
            
        ]
        
    },
    {
        "title": "Cell biomechanics in silico: Model development and validation ",
        "abstract": "The aim of this project is to develop computational framework for the simulations of cells in flows. In order to achieve this goal, we will develop a new cell model and software efficiently exploiting modern supercomputers. The model will be extensively validated using quantitative experimental data provided by our collaborators.",
        "link" :"https://search.usi.ch/projects/1023/cell-biomechanics-in-silico-model-development-and-validation",
        "group" : "Scientific Computing Laboratory (Prof. Pivkin)",
        "start" : "01.03.2018",
        "end": "28.02.2021",
        "duration" : "36 Months",
        "funding" : "SNSF",
        "status" : "Active",
        "category": "Swiss National Science Foundation / Project Funding / Division II - Mathematics, Natural and Engineering Sciences ",
        "image":"projectImages/furies.jpg",
        
        "members": [
            {
                "name": "Pivkin I.",
                "role": "(Responsible)"       
            }            
        ]   
    }
]
